const minus = require('./minus');
// 2 - 5 เท่ากับ -3
test("2 - 5 เท่ากับ -3", () => {
  expect(minus(2, 5)).toBe(-3);
});


// 75 - 50 เท่ากับ 25
test("75 - 50 เท่ากับ 25", () => {
    expect(minus(75, 50)).toBe(25);
});

// -50 - 50 เท่ากับ -100
test("-50 - 50 เท่ากับ -100", () => {
    expect(minus(-50, 50)).toBe(-100);
});

// 85 - 10.5 เท่ากับ 74.5
test("85 - 10.5 เท่ากับ 74.5", () => {
    expect(minus(85, 10.5)).toBe(74.5);
});

// 10.5 - 0.25 เท่ากับ 10.25
test("10.5 - 0.25 เท่ากับ 10.25", () => {
    expect(minus(10.5, 0.25)).toBe(10.25);
});